W6D4/art_share_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        # users = User.new(params.require(:user).permit(:age,:username,:email,:political_affiliation))
        # render plain: "I'm in the index action! Hi Zhang Zhang"
        users = User.all

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Alex"], ["email", "alex@gmail.com"], ["created_at", "2020-09-02 23:36:51.727512"], ["updated_at", "2020-09-02 23:36:51.727512"]]
---
    def create
        # debugger
        # render json: params
        # debugger
        user = User.new(user_params)
        if user.save!