W6D5/cats99/app/controllers/cats_controller.rb

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        # cat = Cat.new(params)
        if @cat = Cat.create!(cat_params)

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "sex" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "black"], ["sex", "M"], ["updated_at", "2020-09-05 18:19:01.628734"], ["id", 3]]
---
    def update
        @cat = Cat.find(params[:id])
        if @cat.update (cat_params)